In [1]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost

In [2]:
%%sql 
show databases;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('information_schema',), ('library',), ('mysql',), ('performance_schema',)]

In [3]:
%%sql
use library;

CREATE TABLE Customers (
    customer_id INT PRIMARY KEY,
    name VARCHAR(100),
    email VARCHAR(100),
    address VARCHAR(255)
);

CREATE TABLE Products (
    product_id INT PRIMARY KEY,
    name VARCHAR(100),
    category VARCHAR(50),
    price DECIMAL(10, 2),
    stock_qty INT
);

CREATE TABLE Orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    status VARCHAR(20),
    FOREIGN KEY (customer_id) REFERENCES Customers(customer_id)
);

CREATE TABLE Order_Items (
    item_id INT PRIMARY KEY,
    order_id INT,
    product_id INT,
    quantity INT,
    price DECIMAL(10,2),
    FOREIGN KEY (order_id) REFERENCES Orders(order_id),
    FOREIGN KEY (product_id) REFERENCES Products(product_id)
);

CREATE TABLE Payments (
    payment_id INT PRIMARY KEY,
    order_id INT,
    amount DECIMAL(10,2),
    method VARCHAR(20),
    status VARCHAR(20),
    FOREIGN KEY (order_id) REFERENCES Orders(order_id)
);

CREATE TABLE Reviews (
    review_id INT PRIMARY KEY,
    customer_id INT,
    product_id INT,
    rating INT,
    comment TEXT,
    FOREIGN KEY (customer_id) REFERENCES Customers(customer_id),
    FOREIGN KEY (product_id) REFERENCES Products(product_id)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [4]:
%%sql
-- Customers
INSERT INTO Customers VALUES 
(1, 'Aarav Mehta', 'aarav@gmail.com', 'Mumbai'),
(2, 'Isha Rani', 'isha@gmail.com', 'Chennai');

-- Products
INSERT INTO Products VALUES 
(101, 'Smartphone', 'Electronics', 15000.00, 50),
(102, 'Headphones', 'Electronics', 2000.00, 100),
(103, 'Bookshelf', 'Furniture', 3500.00, 10);

-- Orders
INSERT INTO Orders VALUES 
(1001, 1, '2025-07-15', 'shipped'),
(1002, 2, '2025-07-17', 'pending');

-- Order_Items
INSERT INTO Order_Items VALUES 
(1, 1001, 101, 1, 15000.00),
(2, 1001, 102, 2, 4000.00),
(3, 1002, 103, 1, 3500.00);

-- Payments
INSERT INTO Payments VALUES 
(5001, 1001, 19000.00, 'UPI', 'paid'),
(5002, 1002, 3500.00, 'COD', 'pending');

-- Reviews
INSERT INTO Reviews VALUES 
(701, 1, 101, 5, 'Excellent phone!'),
(702, 2, 103, 4, 'Good furniture but delivery was late.');

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.
3 rows affected.
2 rows affected.
3 rows affected.
2 rows affected.
2 rows affected.

[]

In [5]:
%%sql
SELECT C.name, O.order_id, P.name AS product, OI.quantity
FROM Customers C
JOIN Orders O ON C.customer_id = O.customer_id
JOIN Order_Items OI ON O.order_id = OI.order_id
JOIN Products P ON OI.product_id = P.product_id;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Aarav Mehta', 1001, 'Smartphone', 1),
 ('Aarav Mehta', 1001, 'Headphones', 2),
 ('Isha Rani', 1002, 'Bookshelf', 1)]

In [6]:
%%sql
SELECT SUM(amount) AS total_revenue
FROM Payments
WHERE status = 'paid';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(Decimal('19000.00'),)]

In [7]:
%%sql
SELECT P.name, SUM(OI.quantity) AS total_sold
FROM Products P
JOIN Order_Items OI ON P.product_id = OI.product_id
GROUP BY P.name
ORDER BY total_sold DESC
LIMIT 3;

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Headphones', Decimal('2')),
 ('Smartphone', Decimal('1')),
 ('Bookshelf', Decimal('1'))]

In [8]:
%%sql
SELECT P.name, AVG(R.rating) AS avg_rating
FROM Products P
JOIN Reviews R ON P.product_id = R.product_id
GROUP BY P.name;

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[('Smartphone', Decimal('5.0000')), ('Bookshelf', Decimal('4.0000'))]

In [9]:
%%sql
SELECT C.name, P.amount
FROM Customers C
JOIN Orders O ON C.customer_id = O.customer_id
JOIN Payments P ON O.order_id = P.order_id
WHERE P.status = 'pending';

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[('Isha Rani', Decimal('3500.00'))]